{
  "load_error.1": "After running the project, please obtain the webview address and paste it into the Base 'extension script' for use. For details, see: ",
  "load.guide": "Development Guide",
  "btn.search": "Search",
  "action": "Action",
  "open.new.window": "Open in new window",
  "search.label": "Search content",
  "plz.enter.1": "Please enter search content",
  "search.tooltip": "More powerful search: Search the original data format, including emails, attachment file types, group links, and other data not directly displayed in the table. Search results will be presented in the original data. Note: Enabling this will invalidate the ^$ in regular expressions.",
  "search.usereg": "Use regular expressions for search content",
  "search.detail": "Detailed search",
  "search.table.label": "Search range - Data table",
  "search.table.desc": "Please select a data table",
  "uploading.now": "Uploading:",
  "upload.error": "Upload error (if in the client, please try changing the browser)",
  "function.errot": "Function execution error",
  "function.dealare.error": "Function declaration error, please check the code",
  "compares.tooltip": "Use the custom function pickFile to determine which files to upload for each record. The fields selected in this option will be used as parameters for the pickFile function.",
  "pickFile.label": "Custom file selection rules",
  "please.choose.file": "Please select a file",
  "selected.num.file": "{{num}} files selected",
  "upload.end": "File upload completed",
  "upload.file": "Upload file",
  "overWrite.exit.file": "Overwrite existing files",
  "select.pickField": "Select matching field",
  "select.fileFieldId": "Select attachment field",
  "select.view": "Select view",
  "select.table": "Select data table",
  "is.matching": "Matching fields and attachments",
  "btn.add.upload.file": "Upload file",
  "file.field.missing": "No attachment field found in the current view. Please add an attachment field and re-run the plugin or switch views.",
  "upload.by.new.record": "Batch upload files, one file generates a new record",
  "upload.by.new.record.title": "Batch upload files to new records",
  "upload.by.name.title": "Upload files matching field names",
  "upload.by.name.desc": "1. This mode supports uploading files to records corresponding to the file name (without suffix). Ensure the file name (without suffix) matches the field name exactly.\n2. If the matching field contains multiple names, attachments will also be automatically matched and uploaded (use commas, periods, semicolons, spaces, or newlines to separate multiple names).\n3. Text fields are supported by default. For other fields, customize the file selection rules.",
  "code.1": "This function will act on all records and select the files needed for each record.",
  "code.2": "Use a multi-line text field as the identifier. Based on the file names entered in the identifier field (separated by commas, periods, semicolons, spaces, or newlines), find the corresponding files in the selected files and upload them to the attachment field of the record.",
  "code.3": "Upload files based on the file names in the selected identifier field.",
  "code.4": "compareValues: The original value array of the selected identifier field cell for the current record, in the same order as the selected options.",
  "code.5": "The value of the first identifier field for this record (e.g., a multi-line text field).",
  "code.6": "fileList: Selected files.",
  "code.7": "Multi-line text field values are arrays or null. Empty records are filtered out.",
  "code.8": "Extract file names from the identifier field using separators.",
  "code.9": "File name (excluding file extension).",
  "code.10": "Filter required files based on the identifier field.",
  "code.21": "If no file is matched, the original attachment is used.",
  "code.23": "This function will act on all records and select the files needed for each record (priority is lower than the 'Overwrite existing files' switch below).",
  "self.reg": "Custom delimiter",
  "code.24": "compareValues: The original value array of the selected identifier field cell for the current record, in the same order as the selected options.",
  "code.25": "fileList: List of all selected files.",
  "code.26": "currentValue: The value of the selected attachment field for the current record.",
  "self.reg.tooltip": "Treat each character as a delimiter to separate file names in the matching field.",
  "choose.mode": "Select mode",
  "space": "Space",
  "e": "Newline",
  "upload.error.files": "An error occurred while uploading the following files:",
  "btn.preview": "File upload preview"
}